#### Bibliotecas para Data Science

Pandas, Numpy e Scikit-Learn

In [1]:
# carregando um arquivo de dados com Pandas

In [2]:
import pandas as pd

In [3]:
dataframe = pd.read_csv('../dados/tempo_salarios.csv')
dataframe.head()

   AnosdeExperiencia  Salario
0                1.1  39343.0
1                1.3  46205.0
2                1.5  37731.0
3                2.0  43525.0
4                2.2  39891.0

In [4]:
# criando objetos Series

In [5]:
print('criando uma instância de Series a partir de uma\
 lista numérica:')

copa_do_mundo = pd.Series([1952, 1962, 1970, 1994, 2002])

print('anos em que o Brasil foi campeão mundial de futebol:')
print(f'{copa_do_mundo}')

criando uma instância de Series a partir de uma lista numérica:
anos em que o Brasil foi campeão mundial de futebol:
0    1952
1    1962
2    1970
3    1994
4    2002
dtype: int64

In [6]:
s = pd.Series((1, 2, 3))
print(f'\ncriando uma série a partir de uma tupla:')
print(s)
print(f'tipo de variável: {type(s)}')

criando uma série a partir de uma tupla:
0    1
1    2
2    3
dtype: int64
tipo de variável: <class 'pandas.core.series.Series'>

In [7]:
s = pd.Series({'a': 1, 'b': 2, 'c': 3})
print('\ncriando uma série a partir de um dicionário:')
print(s)
print(f'tipo da variável: {type(s)}')

criando uma série a partir de um dicionário:
a    1
b    2
c    3
dtype: int64
tipo da variável: <class 'pandas.core.series.Series'>

In [8]:
s = pd.Series(['Wes McKinney', 'Criador da Pandas'], 
              index = ['Pessoa', 'Quem'])

print(f'\ncriando uma série a partir de uma lista de \
 valores e outra de rótulos:')

print(s)
print(f'tipo da variável: {type(s)}')

criando uma série a partir de uma lista de  valores e outra de rótulos:
Pessoa         Wes McKinney
Quem      Criador da Pandas
dtype: object
tipo da variável: <class 'pandas.core.series.Series'>

In [9]:
# exibindo o cabeçalho e o rodapé do seu dataset

In [10]:
dataframe.head()

   AnosdeExperiencia  Salario
0                1.1  39343.0
1                1.3  46205.0
2                1.5  37731.0
3                2.0  43525.0
4                2.2  39891.0

In [11]:
dataframe.tail()

    AnosdeExperiencia   Salario
25                9.0  105582.0
26                9.5  116969.0
27                9.6  112635.0
28               10.3  122391.0
29               10.5  121872.0

In [12]:
dataframe.head(15)

    AnosdeExperiencia  Salario
0                 1.1  39343.0
1                 1.3  46205.0
2                 1.5  37731.0
3                 2.0  43525.0
4                 2.2  39891.0
5                 2.9  56642.0
6                 3.0  60150.0
7                 3.2  54445.0
8                 3.2  64445.0
9                 3.7  57189.0
10                3.9  63218.0
11                4.0  55794.0
12                4.0  56957.0
13                4.1  57081.0
14                4.5  61111.0

In [13]:
# conferindo a quantidade de entradas no dataset

In [15]:
print(len(dataframe))

30

In [16]:
# examinando tipos de dados

In [17]:
dataframe.dtypes

AnosdeExperiencia    float64
Salario              float64
dtype: object

In [18]:
dataframe.describe()

       AnosdeExperiencia        Salario
count          30.000000      30.000000
mean            5.313333   76003.000000
std             2.837888   27414.429785
min             1.100000   37731.000000
25%             3.200000   56720.750000
50%             4.700000   65237.000000
75%             7.700000  100544.750000
max            10.500000  122391.000000

In [20]:
dataframe['AnosdeExperiencia'].head()

0    1.1
1    1.3
2    1.5
3    2.0
4    2.2
Name: AnosdeExperiencia, dtype: float64

In [23]:
dataframe.Salario[5:10] # uma fatia da coluna salário do dataframe

5    56642.0
6    60150.0
7    54445.0
8    64445.0
9    57189.0
Name: Salario, dtype: float64

In [25]:
dataframe.Salario[5:10].values

array([56642., 60150., 54445., 64445., 57189.])

In [26]:
dataframe[0:5]

   AnosdeExperiencia  Salario
0                1.1  39343.0
1                1.3  46205.0
2                1.5  37731.0
3                2.0  43525.0
4                2.2  39891.0

In [27]:
dataframe[20:30]

    AnosdeExperiencia   Salario
20                6.8   91738.0
21                7.1   98273.0
22                7.9  101302.0
23                8.2  113812.0
24                8.7  109431.0
25                9.0  105582.0
26                9.5  116969.0
27                9.6  112635.0
28               10.3  122391.0
29               10.5  121872.0

In [31]:
dataframe[:-25]

   AnosdeExperiencia  Salario
0                1.1  39343.0
1                1.3  46205.0
2                1.5  37731.0
3                2.0  43525.0
4                2.2  39891.0

In [32]:
dataframe[-10:]

    AnosdeExperiencia   Salario
20                6.8   91738.0
21                7.1   98273.0
22                7.9  101302.0
23                8.2  113812.0
24                8.7  109431.0
25                9.0  105582.0
26                9.5  116969.0
27                9.6  112635.0
28               10.3  122391.0
29               10.5  121872.0

In [33]:
# as funções iloc() e loc()

In [ ]:
dataframe[3] # erro

In [38]:
dataframe.loc[3]

AnosdeExperiencia        2.0
Salario              43525.0
Name: 3, dtype: float64

In [41]:
dataframe.loc[dataframe.Salario > 80_000] # filtro para salários superiores à 80.000

    AnosdeExperiencia   Salario
17                5.3   83088.0
18                5.9   81363.0
19                6.0   93940.0
20                6.8   91738.0
21                7.1   98273.0
22                7.9  101302.0
23                8.2  113812.0
24                8.7  109431.0
25                9.0  105582.0
26                9.5  116969.0
27                9.6  112635.0
28               10.3  122391.0
29               10.5  121872.0

In [45]:
# .iloc[linhas, colunas]
dataframe.iloc[0:30, 0:1] # mesmo que dataframe.iloc[:,0:1]

    AnosdeExperiencia
0                 1.1
1                 1.3
2                 1.5
3                 2.0
4                 2.2
5                 2.9
6                 3.0
7                 3.2
8                 3.2
9                 3.7
10                3.9
11                4.0
12                4.0
13                4.1
14                4.5
15                4.9
16                5.1
17                5.3
18                5.9
19                6.0
20                6.8
21                7.1
22                7.9
23                8.2
24                8.7
25                9.0
26                9.5
27                9.6
28               10.3
29               10.5

In [46]:
dataframe.iloc[0:30, 0:1].values

array([[ 1.1],
       [ 1.3],
       [ 1.5],
       [ 2. ],
       [ 2.2],
       [ 2.9],
       [ 3. ],
       [ 3.2],
       [ 3.2],
       [ 3.7],
       [ 3.9],
       [ 4. ],
       [ 4. ],
       [ 4.1],
       [ 4.5],
       [ 4.9],
       [ 5.1],
       [ 5.3],
       [ 5.9],
       [ 6. ],
       [ 6.8],
       [ 7.1],
       [ 7.9],
       [ 8.2],
       [ 8.7],
       [ 9. ],
       [ 9.5],
       [ 9.6],
       [10.3],
       [10.5]])

In [47]:
transportes = pd.read_csv('../dados/transportes.csv')
transportes

           Tipo  Velocidade   Peso  Consumo  Autonomia      Valor
0   Motocicleta         120    116     41.0        656      25000
1     Automovel         140   2000     15.0        800      55000
2   Helicoptero         280    450      5.0       1262    7000000
3         Aviao         900  28000      0.3      12000  112000000
4  Motoplanador         200    322     18.0       1200     150000
5     Bicicleta          30     11      0.0        100        700

In [ ]:
transportes.loc['Motocicleta'] # erro

In [50]:
transportes = pd.read_csv('../dados/transportes.csv', index_col=0)
transportes

              Velocidade   Peso  Consumo  Autonomia      Valor
Tipo
Motocicleta          120    116     41.0        656      25000
Automovel            140   2000     15.0        800      55000
Helicoptero          280    450      5.0       1262    7000000
Aviao                900  28000      0.3      12000  112000000
Motoplanador         200    322     18.0       1200     150000
Bicicleta             30     11      0.0        100        700

In [51]:
transportes.loc['Motocicleta']

Velocidade      120.0
Peso            116.0
Consumo          41.0
Autonomia       656.0
Valor         25000.0
Name: Motocicleta, dtype: float64

In [52]:
# limpeza de valores ausentes